VPro/src/Catalogs/ServiceContractsTariffPlans/ServiceContractsTariffPlans.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ServiceContractsTariffPlans</name>
  <attributes>
    <name>UnplannedCostsIncludeInInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsProhibit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsPresentationInInvoice</name>
    <type>
      <types>CatalogRef.ProductsAndServices</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsPricingMethod</name>
    <type>
      <types>EnumRef.BillingCostsPricingMethod</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsMarkup</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsFixedPrice</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedItemsIncludeInInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedItemsProhibit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedItemsPresentationInInvoice</name>
    <type>
      <types>CatalogRef.ProductsAndServices</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CostAccounting</name>
    <attributes>
      <name>CostsItem</name>
      <type>
        <types>ChartOfAccountsRef.Managerial</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeInInvoice</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PricingMethod</name>
      <type>
        <types>EnumRef.BillingCostsPricingMethod</types>
      </type>
    </attributes>
    <attributes>
      <name>PresentationInAccount</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>AddPeriodToContent</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProductsAndServicesAccounting</name>
    <attributes>
      <name>ProductsAndServices</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>CHARACTERISTIC</name>
      <type>
        <types>CatalogRef.ProductsAndServicesCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeInInvoice</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PricingMethod</name>
      <type>
        <types>EnumRef.BillingProductsAndServicesPricingMethod</types>
      </type>
    </attributes>
    <attributes>
      <name>PresentationInAccount</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>AddPeriodToContent</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/ServiceContractsTariffPlans/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Проверяет, имеются ли в базе тарифные планы с заполненными условиями по перевыставлению затрат:
//  — если имеются запланированные затраты,
//  — если задано какое-либо правило для внеплановых затрат.
// 
// Returns:
//   - Boolean
//
Function HasTariffPlansWithCostsAccounting() Export
	
	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	ServiceContractsTariffPlans.Ref
	|FROM
	|	Catalog.ServiceContractsTariffPlans AS ServiceContractsTariffPlans
	|WHERE
	|	(ServiceContractsTariffPlans.UnplannedCostsIncludeInInvoice
	|			OR ServiceContractsTariffPlans.UnplannedCostsProhibit)
	|
	|UNION
	|
	|SELECT
	|	ServiceContractsTariffPlansCostAccounting.Ref
	|FROM
	|	Catalog.ServiceContractsTariffPlans.CostAccounting AS ServiceContractsTariffPlansCostAccounting";
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

// Возвращает представление в счете объекта договора обслуживания в соответствии с тарифным планом.
//
// Parameters:
//  TariffPlan                - CatalogRef.ServiceContractsTariffPlans
//  ServiceContractObject  - СправочникСсылка.Номенклатура, ПланСчетовСсылка.Управленческий
// 
// Returns:
//   - CatalogRef.ProductsAndServices
//
Function PresentationInAccount(TariffPlan, ServiceContractObject) Export
	
	If TypeOf(ServiceContractObject) = Type("CatalogRef.ProductsAndServices") Then
		Row = TariffPlan.ProductsAndServicesAccounting.Find(ServiceContractObject, "ProductsAndServices");
		If Row <> Undefined Then
			Return Row.PresentationInAccount;
		EndIf;
	ElsIf TypeOf(ServiceContractObject) = Type("ChartOfAccountsRef.Managerial") Then
		Row = TariffPlan.CostAccounting.Find(ServiceContractObject, "CostsItem");
		If Row <> Undefined Then
			Return Row.PresentationInAccount;
		EndIf;
	EndIf;
	
	Return Undefined;
	
EndFunction

#EndRegion

#EndIf
